package Les01_basic.c001_IfSwitch;

import java.util.Scanner;

public class ex03_SwitchDemo {
    /* Оператор ветвления if-else при большом количестве вариантов
    становится громоздкой многоэтажной конструкцией,
    которую трудно читать-понимать.
    если вариантов более 4 следует применять
    конструкцию выбора
    switch-case  (переключатель-на-случай)
     */

    public static void main(String[] args) {
        // Задача: вывести инфо о дне неделе
        // в зависимости от номера дня

        Scanner in = new Scanner(System.in);
        System.out.print("Введите целое число - номер дня недели:");
        int day = in.nextInt();
        System.out.println();

        switch (day) {
            case 1: // вариант или случай: day == 1
                System.out.println("Понедельник - начало недели");
                break; // прерывание просмотра других вариантов и выход за switch
            case 2:
                System.out.println("Вторник - работа в разгаре");
                break;
            case 3:
                System.out.println("Среда - маленькая пятница!");
                break;
            case 4:
                System.out.println("Четверг - почти выходные");
                break;
            case 5:
                System.out.println("Пятница - ура! 🎉");
                break;
            case 6:
            case 7:
                System.out.println("Выходной день! 😊");
                break;
            default:
                System.out.println("Неверный номер дня");
        }
    }
}

